---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoFittingLoadedInProjectError
source: html/335e5734-93f4-f96b-fdb8-5cdbb46a0136.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoFittingLoadedInProjectError Property

The fitting that is converted to was not defined. Please load one fitting family and assign it in the routing preference.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoFittingLoadedInProjectError { get; }
```